#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/manage-user-details"]: Refreshing state... [id=9ab20ecc-c39f-45d4-992c-8290579a247d/1ba3bbcb-d2db-4cb3-be33-2f88062e0dac]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/manage-user-roles"]: Refreshing state... [id=9ab20ecc-c39f-45d4-992c-8290579a247d/f539f4bf-ba7a-4ba3-a8d4-a47f786e205d]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/86ec4f91-45fb-4e65-ae4f-e1b952fd4e47]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=9ab20ecc-c39f-45d4-992c-8290579a247d/beddbeb0-650e-4bd9-8484-d05f789c61b6]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/60dfb3b9-5ceb-4498-a24c-9641796bd991/43bf4fca-777a-4c9c-9127-f9677c654fef]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/7489c26e-77c8-47ad-9c07-a9bb97a37d91]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/65d6f8b7-0703-46ed-9ced-55457bd6c14b]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_amh_demo"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/c887cf6e-ee42-4807-a8b5-77b6c46fe218]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_amh_demo"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/f3d5d424-88cb-472f-a0b9-b99cc342f40f]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/7f31f194-bfcc-43fd-babe-bc9545292ede]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/2e52bc4c-f321-4bff-98d8-8ce89cd3e2e7/22f2f067-d74a-4108-bf1a-eb6bffd71736]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/a94bec86-0808-4f71-a947-b2049afc7d7e]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/9dbc8e8b-0e25-44cd-bd1b-34a1846ac269]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRP.keycloak_openid_client.CLIENT has changed
  ~ resource "keycloak_openid_client" "CLIENT" {
      + extra_config                               = {}
        id                                         = "cdd25983-7e5d-4d16-8c53-b650b0646246"
      + valid_redirect_uris                        = []
      + web_origins                                = []
        # (23 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "BEARER-ONLY"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "LDAP-API"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Client created to send requests to Organizations API"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["offline_access"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "offline_access"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["uma_authorization"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "uma_authorization"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["ORGANIZATIONS-API/get-org"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "e80136f5-76d2-4286-bde2-ea835b0e2b64"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "get-org"
      + service_account_user_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*